fun main() {
    val seconds = 60*53
    val minutes = seconds / 60
    val hours = seconds / 3600
    fun agoToText() {

        fun agoMin() = when (seconds) {
            in 0..60 -> "Был(а) только что"
            in 61..120 -> "Был(а) в сети 1 минуту назад"
            in 121..60 * 5 -> "Был(а) в сети $minutes минуты назад"
            in 60 * 5 + 1..60 * 21 -> "Был(а) в сети $minutes минут назад"
            in 60 * 21 + 1..60 * 22 -> "Был(а) в сети $minutes минуту назад"
            in 60 * 22 + 1..60 * 25 -> "Была в сети $minutes минуты назад"
            in 60 * 25 + 1..60 * 31 -> "Была в сети $minutes минут назад"
            in 60 * 31 + 1..60 * 32 -> "Была в сети $minutes минуту назад"
            in 60 * 32 + 1..60 * 35 -> "Была в сети $minutes минуты назад"
            in 60 * 35 + 1..60 * 41 -> "Была в сети $minutes минут назад"
            in 60 * 41 + 1..60 * 42 -> "Была в сети $minutes минуту назад"
            in 60 * 42 + 1..60 * 45 -> "Была в сети $minutes минуты назад"
            in 60 * 45 + 1..60 * 51 -> "Была в сети $minutes минут назад"
            in 60 * 51 + 1..60 * 52 -> "Была в сети $minutes минуту назад"
            in 60 * 52 + 1..60 * 55 -> "Была в сети $minutes минуты назад"
            in 60 * 55 + 1..60 * 59 -> "Была в сети $minutes минут назад"
            else -> "Был(а) в сети час назад"
        }

        fun agoHour() = when (seconds) {
            in 60*60..60*60+1 -> "Был(а) в сети $hours час назад"
            in 2*60*60..4*60*60 -> "Был(а) в сети $hours часа назад"
            in 4*60*60+1..20*60*60 -> "Был(а) в сети $hours часов назад"
            in 20*60*60+1..21*60*60 -> "Был(а) в сети $hours час назад"
            in 21*60*60+1..24*60*60 -> "Был(а) в сети $hours часа назад"
            in 24 * 60 * 60 + 1..24 * 60 * 60 * 2 -> "Последний раз был(а) сегодня"
            in 24 * 60 * 60 * 2 + 1..24 * 60 * 60 * 3 -> "Последний раз был(а) вчера"
            else -> "Последний раз был(а) давно"
        }
        if (seconds in 0..60*59) println(agoMin()) else println(agoHour())
    }
agoToText()


}
